OpenFOAM/thermofluid/tutorials/deprecatedTutorials/galliumMelting/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1.0;

vertices
(
    (0.0 0.0 0.0) 		//0
    (0.0889 0.0 0.0) 		//1
    (0.0889 0.01 0.0) 	//2
    (0.0 0.01 0.0) 	//3
    (0.0 0.0 0.0635)		//4
    (0.0889 0.0 0.0635)		//5
    (0.0889 0.01 0.0635)		//6
    (0.0 0.01 0.0635)		//7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (100 1 50) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    leftWall
    {
        type patch;
        faces
        (
            (0 3 7 4)
        );
    }
    rightWall
    {
        type patch;
        faces
        (
            (1 5 6 2)
        );
    }

    topWall
    {
	type patch;
	faces
	(
	   (4 7 6 5)
	);
    }

    bottomWall
    {
	type patch;
	faces
	(
	  (0 1 2 3)
	);
    }

    frontAndBack
    {
        type empty;
        faces
        (
		(2 6 7 3)
		(0 4 5 1)
        );
    }
);

mergePatchPairs
(
);


// ************************************************************************* //
