OpenFOAM/thermofluid/tutorials/deprecatedTutorials/galliumMelting/constant/thermalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

	C		  C [ 1 -3 -1 0 0 0 0 ] 1e8; 

    	betaG             betaG [ 0 0 0 -1 0 0 0 ] 0.0;
	betaL             betaL [ 0 0 0 -1 0 0 0 ] 1.20e-4;
    	betaS             betaS [ 0 0 0 -1 0 0 0 ] 1.20e-4;

	TRef          	   TRef [ 0 0 0 1 0 0 0 ] 301.3;
	Tl                Tl     [ 0 0 0 1 0 0 0 ]   303.23;
	Ts                Ts     [ 0 0 0 1 0 0 0 ]   302.63;
	Hf                8.016e4; // St = 1.0

// ************************************************************************* //
