OpenFOAM/thermofluid/tutorials/deprecatedTutorials/galliumMelting/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

libs
(
    "liblduSolvers.so"
)

application     laserMeltFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime        	0.1;

deltaT          0.001;

writeControl    runTime;

writeInterval   0.01;

purgeWrite      0;

writeFormat     ascii;

writePrecision  12;

writeCompression uncompressed;

timeFormat      general;

timePrecision   6;

runTimeModifiable no;

adjustTimeStep  no;

maxCo           0.5;

maxAlphaCo	0.5;

maxDeltaT       0.001;

functions
{
   // Writes alpha1 = 0.5 isoSurface and velocity field sampled at it
    surfaceSampling
      {
        type surfaces;

        functionObjectLibs ("libsampling.so");
        enabled         true;
        outputControl   outputTime;
        outputInterval  1;
        interpolationScheme cellPoint;
        surfaceFormat raw;

        // Fields to be sampled
        fields
	  (
            alpha.liquid
	   );

        surfaces
	  (
            alpha0p5
            {
	      // Iso surface for constant values.
	      // Triangles guaranteed not to cross cells.
	      // isoSurfaceCell seems to be smoother than isoSurface
	      type            isoSurfaceCell;
	      isoField        alpha.liquid;
	      isoValue        0.5;
	      interpolate     true; 
	      regularise      false;       // Do not simplify 
            }
	   );
      }

}

// ************************************************************************* //
