OpenFOAM/thermofluid/tutorials/deprecatedTutorials/galliumMelting/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.material 1
);

regions
(
/*	cylinderToCell
	{
		p1 (0.05 0 0.05); //Min
		p2 (0.05 0.01 0.05); //Max
		radius 0.005;
		fieldValues
        	(
            		volScalarFieldValue alpha.material    0
            		//volScalarFieldValue alpha.liquid      0
        	);
	}
*/
);


// ************************************************************************* //
